import type { ElfDeconstructedProfile } from "../../effects/types";

export const OpeiaDeconstructedProfile: any = {
  id: 'opeia',
  name: '蟲后·奧佩婭',
  soulMark: {
    hou: {
      id: 'mark.hou',
      effectClass: 'MARK',
      polarity: 'NEUTRAL',
      flavor: {
        name: '后',
        description: '登場時：己方背包內所有精靈每有n隻存活或識別帶有蟲系的精靈則自身直到下場獲得等同於所有能力值n*10%總和的臨時能力值且前n次自身攻擊技能連擊次數+1；敵方背包內所有精靈每有一隻陣亡或識別帶有蟲系的精靈則直到下場前對手使用攻擊技能時攻擊威力降低10%；前述效果觸發時若敵我雙方存在識別帶有混沌系的精靈，則場下所有帶有混沌系精靈所有能力值降低60%並附加給自身，自身直到下場前無視對手攻擊免疫效果、攻擊免疫/抵擋/轉化傷害效果、攻擊傷害限制效果；對手使用技能時：若該技能為攻擊技能時令對手下次屬性技能附加效果失效(下場後保留)，若該技能為屬性技能時令對手下次攻擊技能附加效果失效(下場後保留)；每次觸發前述效果時，恢復自身最大體力50%，令對手當回合造成的非真實傷害降低50%且當回合戰鬥階段結束時令使用的技能PP值歸0；該技能為攻擊技能則額外令對手所有相同類型的技能PP值歸0；該技能為屬性技能則額外令2回合內自身受到非真實傷害降低效果觸發時比例變為99%；自身使用技能時：不消耗技能PP值；100%令對手中毒，未觸發則消除對手回合類效果並有等同於自身體力當前百分比機率令對手害怕；若該技能PP值為滿或為屬性技能，則當回合出手流程結束時將對手所處的中毒異常狀態轉化為感染；若該技能PP值不為滿或為攻擊技能，吸取對手所有技能2點PP值',
      }
    }
  },
  skills: {}
};

